## **Pandas**

### Pandsa & Numpy

**Pandas** - Pandas is made for data science\
**Numpy** - Numpy is for pure numerical operations. Shortcut for NUmerical PYthon

In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv("Data/mckinsey.csv")
df

          country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [5]:
type(df)

pandas.core.frame.DataFrame

In [7]:
type(df['life_exp'])

pandas.core.series.Series

In [8]:
type(df[['country','year']])

pandas.core.frame.DataFrame

### 
**DataFrame** - When CSV data is loaded, entire data is loaded as table and is called DataFrame\
**Series** - A single column or single row is called as Series

Note - When multiple columns are selected, it will be considered as DataFrame

**In Numpy** - All columns and rows should be of same datatype - Homogeneous\
**In Pandas** - All the data in each column should be Homogeneous and entire dataframe can be hetrogeneous

### Basic Operations

In [9]:
df.head() # First 5 rows

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [10]:
df.head(3) # First 3 rows

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710

In [11]:
df.tail() # Last 5 rows

       country  year  population continent  life_exp     gdp_cap
1699  Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700  Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703  Zimbabwe  2007    12311143    Africa    43.487  469.709298

In [12]:
df.tail(3) # Last 3 rows

       country  year  population continent  life_exp     gdp_cap
1701  Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703  Zimbabwe  2007    12311143    Africa    43.487  469.709298

In [13]:
df.shape # Shape of the dataframe in (# of Rows, # of Columns)

(1704, 6)

In [14]:
df.info() # Data info of the DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     1704 non-null   object
 1   year        1704 non-null   int64
 2   population  1704 non-null   int64
 3   continent   1704 non-null   object
 4   life_exp    1704 non-null   float64
 5   gdp_cap     1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

### 
**By default string is considered as object in the dataframe**\
It also displays if there are any columns with few null values. If there are null values in the column, count would differ

In [16]:
df.isnull() # To check if there are any null values in the dataframe

      country   year  population  continent  life_exp  gdp_cap
0       False  False       False      False     False    False
1       False  False       False      False     False    False
2       False  False       False      False     False    False
3       False  False       False      False     False    False
4       False  False       False      False     False    False
...       ...    ...         ...        ...       ...      ...
1699    False  False       False      False     False    False
1700    False  False       False      False     False    False
1701    False  False       False      False     False    False
1702    False  False       False      False     False    False
1703    False  False       False      False     False    False

[1704 rows x 6 columns]

In [22]:
# Dictionary of Students
stu_dict = {
    'name': ['Chaitanya','Subha','Sagar', np.nan],
    'age': [37, 38, 39, 40],
    'Sal': ['1 CR','2 CR','3 CR', np.nan]
}

In [23]:
# Create a DataFrame from the Dictionary
stu_df = pd.DataFrame(stu_dict)
stu_df

        name  age   Sal
0  Chaitanya   37  1 CR
1      Subha   38  2 CR
2      Sagar   39  3 CR
3        NaN   40   NaN

In [24]:
stu_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     4 non-null      int64
 2   Sal     3 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

### 
If there are any null values, count would be updated respectively

In [25]:
stu_df.isnull() # Will let us know where we have null values in the DataFrame

    name    age    Sal
0  False  False  False
1  False  False  False
2  False  False  False
3   True  False   True

In [28]:
stu_df.isnull().sum() # This will display what is the total count of NULLvalues in each column

name    1
age     0
Sal     1
dtype: int64

### Operations on Columns
To get Columns in the dataframe

Both df.columns and df.keys() will return the same values

In [29]:
df.columns

Index(['country', 'year', 'population', 'continent', 'life_exp', 'gdp_cap'], dtype='object')

In [30]:
df.keys()

Index(['country', 'year', 'population', 'continent', 'life_exp', 'gdp_cap'], dtype='object')

In [31]:
df[['country','gdp_cap']]

          country     gdp_cap
0     Afghanistan  779.445314
1     Afghanistan  820.853030
2     Afghanistan  853.100710
3     Afghanistan  836.197138
4     Afghanistan  739.981106
...           ...         ...
1699     Zimbabwe  706.157306
1700     Zimbabwe  693.420786
1701     Zimbabwe  792.449960
1702     Zimbabwe  672.038623
1703     Zimbabwe  469.709298

[1704 rows x 2 columns]

In [32]:
df[['country','gdp_cap']].head() # 3To get first 5 rows

       country     gdp_cap
0  Afghanistan  779.445314
1  Afghanistan  820.853030
2  Afghanistan  853.100710
3  Afghanistan  836.197138
4  Afghanistan  739.981106

In [33]:
df[['country','gdp_cap']].shape

(1704, 2)

In [34]:
df[['country','gdp_cap']].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   country  1704 non-null   object
 1   gdp_cap  1704 non-null   float64
dtypes: float64(1), object(1)
memory usage: 26.8+ KB

#### Unique Value

In [35]:
df['country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong Kong, China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea, Dem. Rep.',
       'Korea, Rep.', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Sierra Leone', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United Kingdom', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen, Rep.',
       'Zambia', 'Zimbabwe'], dtype=object)

In [37]:
len(df['country'].unique()) # To get the total unique countries

142

In [39]:
df['country'].nunique() # This is same as unique

142

In [42]:
df['country'].value_counts() # Number of times each unique value is repeated in the column

country
Afghanistan          12
Pakistan             12
New Zealand          12
Nicaragua            12
Niger                12
                     ..
Eritrea              12
Equatorial Guinea    12
El Salvador          12
Egypt                12
Zimbabwe             12
Name: count, Length: 142, dtype: int64

In [43]:
stu_df

        name  age   Sal
0  Chaitanya   37  1 CR
1      Subha   38  2 CR
2      Sagar   39  3 CR
3        NaN   40   NaN

### Renaming a column

In [44]:
stu_df.rename({'name':'Name'}) # Updating the column name to Name

        name  age   Sal
0  Chaitanya   37  1 CR
1      Subha   38  2 CR
2      Sagar   39  3 CR
3        NaN   40   NaN

#### Above command is not updated the column because by default in Pandas, axis = 0 for rows

In [48]:
stu_df.rename({'name':'Name'}, axis = 1) # Update name to Name

        Name  age   Sal
0  Chaitanya   37  1 CR
1      Subha   38  2 CR
2      Sagar   39  3 CR
3        NaN   40   NaN

#### To rename multiple columns

In [49]:
stu_df.rename({'name':'Name','age':'Age'}, axis = 1) # Update name and age to Name and Age

        Name  Age   Sal
0  Chaitanya   37  1 CR
1      Subha   38  2 CR
2      Sagar   39  3 CR
3        NaN   40   NaN

#### To make it permanant, we need to put inplace = True

In [50]:
stu_df.rename({'name':'Name','age':'Age'}, axis = 1, inplace = True)

In [51]:
stu_df

        Name  Age   Sal
0  Chaitanya   37  1 CR
1      Subha   38  2 CR
2      Sagar   39  3 CR
3        NaN   40   NaN

### Drop Columns
Let say we want to drop a column, Sal

In [53]:
#stu_df.drop('Sal') # Throws an error because axis is not specified

In [56]:
stu_df['new_sal'] = stu_df['Sal']

In [57]:
stu_df

        Name  Age   Sal new_sal
0  Chaitanya   37  1 CR    1 CR
1      Subha   38  2 CR    2 CR
2      Sagar   39  3 CR    3 CR
3        NaN   40   NaN     NaN

In [58]:
stu_df.drop('new_sal',axis = 1)

        Name  Age   Sal
0  Chaitanya   37  1 CR
1      Subha   38  2 CR
2      Sagar   39  3 CR
3        NaN   40   NaN

In [59]:
stu_df.drop('new_sal',axis = 1, inplace = True) # This will drop the column permanently

In [60]:
stu_df

        Name  Age   Sal
0  Chaitanya   37  1 CR
1      Subha   38  2 CR
2      Sagar   39  3 CR
3        NaN   40   NaN

### Adding a new Column to DataFrame

In [61]:
stu_df['new_age'] = stu_df['Age'] + 10

In [62]:
stu_df

        Name  Age   Sal  new_age
0  Chaitanya   37  1 CR       47
1      Subha   38  2 CR       48
2      Sagar   39  3 CR       49
3        NaN   40   NaN       50

### Basic Operations on Rows

**Implicit Indexing** - Default\
**Explicit Indexing** - We can update index

In [66]:
stu_df.index = list(range(1,5)) # Updating the row index 
stu_df

        Name  Age   Sal  new_age
1  Chaitanya   37  1 CR       47
2      Subha   38  2 CR       48
3      Sagar   39  3 CR       49
4        NaN   40   NaN       50

#### Implicit and Explicit Indexing are super confusing

In [68]:
#stu_df[0] # This throws error since it considers explicit indexing. Now index 0 is not available

In [71]:
stu_df["Name"][1]

'Chaitanya'

In [72]:
stu_df["Name"].index[1]

2

### **loc & iloc**
To reduce confusion, we can use loc and iloc\
- loc will be used for explicit indexing
- iloc will be used for implicit indexing

In [73]:
stu_df.loc[1]

Name       Chaitanya
Age               37
Sal             1 CR
new_age           47
Name: 1, dtype: object

In [74]:
stu_df.iloc[0]

Name       Chaitanya
Age               37
Sal             1 CR
new_age           47
Name: 1, dtype: object

#### Slicing

In [79]:
stu_df.iloc[0:3] # Implicit Indexing, End is exclusive

        Name  Age   Sal  new_age
1  Chaitanya   37  1 CR       47
2      Subha   38  2 CR       48
3      Sagar   39  3 CR       49

In [80]:
stu_df.loc[1:3] # Explicit Indexing, End is inclusive

        Name  Age   Sal  new_age
1  Chaitanya   37  1 CR       47
2      Subha   38  2 CR       48
3      Sagar   39  3 CR       49

In [81]:
stu_df.iloc[0:3, 0:2] # Get first 3 rows and first 2 rows

        Name  Age
1  Chaitanya   37
2      Subha   38
3      Sagar   39

In [82]:
stu_df.iloc[0:3, -2:] # Get first 3 rows and last 2 rows

    Sal  new_age
1  1 CR       47
2  2 CR       48
3  3 CR       49

In [84]:
#stu_df.loc[1:3, 0:2] # This throws an error since we dont have column labels 0 and 1

In [85]:
stu_df.loc[1:3, "Name":"new_age"]

        Name  Age   Sal  new_age
1  Chaitanya   37  1 CR       47
2      Subha   38  2 CR       48
3      Sagar   39  3 CR       49

In [86]:
stu_df.loc[1:3, ["Name","Age"]]

        Name  Age
1  Chaitanya   37
2      Subha   38
3      Sagar   39